app/controllers/layers_controller.rb

  def all
    @layers=Layer.all
---
SELECT "layers".* FROM "layers"