app/controllers/projects_controller.rb

  def unity3ds
    @project=Project.find_by_number(params[:number])
---
SELECT "projects".* FROM "projects" WHERE "projects"."number" = 'QinZhouGang' LIMIT 1

  def plans
    @project=Project.find_by_number(params[:number])
---
SELECT "projects".* FROM "projects" WHERE "projects"."number" = 'QinZhouGang' LIMIT 1

  def layers
    @project=Project.find_by_number(params[:number])
---
SELECT "projects".* FROM "projects" WHERE "projects"."number" = 'QinZhouGang' LIMIT 1

  def unity3d_names
    @project=Project.find_by_number(params[:number])
---
SELECT "projects".* FROM "projects" WHERE "projects"."number" = 'QinZhouGang' LIMIT 1