app/controllers/unity3ds_controller.rb

SELECT "unity3ds".* FROM "unity3ds" WHERE "unity3ds"."objectname" = 'Water' LIMIT 1
---
  def infos
    @unity3d=Unity3d.find_by_objectname(params[:objectname])