app/views/sitemenus/_sitemenus.html.erb

<% sitemenus.each do |menu|  %>
	<% if menu.submenus.length>0%>
---
SELECT "submenus".* FROM "submenus" WHERE "submenus"."sitemenu_id" = ?  [["sitemenu_id", 1]]